In [20]:
import pandas as pd
import numpy as np
import warnings

warnings.filterwarnings('ignore')

In [21]:
df=pd.read_csv('C:\\Data\\Custom\\income_statistics.csv')
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [22]:
df.describe()

       Monthly Income ($)
count        7.000000e+00
mean         1.433929e+06
std          3.777283e+06
min          4.000000e+03
25%          5.500000e+03
50%          7.000000e+03
75%          7.750000e+03
max          1.000000e+07

In [23]:
df['Monthly Income ($)'].quantile(0.25,interpolation='lower')

5000

In [24]:
df[df['Monthly Income ($)']<df['Monthly Income ($)'].quantile(0.99)]

    Name  Monthly Income ($)
0    Rob                5000
1  Rafiq                6000
2   Nina                4000
3  Sofia                7500
4  Mohan                8000
5    Tao                7000

In [25]:
df['Monthly Income ($)'][3]=np.NaN
df

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia                 NaN
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0

In [26]:
df['Monthly Income ($)'].mean()

1671666.6666666667

In [27]:
df['Monthly Income ($)'].median()

6500.0

In [29]:
df['Monthly Income ($)'].fillna(df['Monthly Income ($)'].median(),inplace=True)
df

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia              6500.0
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0